Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.TotalSize
Total expected data size to transfer, in bytes.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.FinishedSize
The transferred data size, in bytes, since the last time this event was raised.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.Speed
Speed(bytes/second) in this event.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.TransferMode
Data transfer mode in this event.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
The event arguments used during the data transferring phase of Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged.
Remarks:
It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
Since:
2017 Subscription Update